narking/CE121/WorkspaceLab01/part2b.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Control_Reg_1.h"
#include "Trigger_aliases.h"
#include "Trigger.h"
#include "Counter_1.h"
#include "Control_Reset.h"
#include "Clock_1.h"
#include "LCD_Char_1.h"
#include "Timer_1.h"
#include "Echo_aliases.h"
#include "Echo.h"
#include "Control_Timer_Reset.h"
#include "isr_1.h"
#include "Clock_2.h"
#include "LED_aliases.h"
#include "LED.h"
#include "Counter_2.h"
#include "Clock_3.h"
#include "LED_Reset.h"
#include "isr_2.h"
#include "SleepTimer_1.h"
#include "LCD_Char_1_LCDPort_aliases.h"
#include "LCD_Char_1_LCDPort.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

